a=input('Введите строку:')
#1
print(a[2]) # выводится символ с индексом 2
#2
print(a[-2]) # выводится предпоследний символ входной строки
#3
print(a[:5]) # выводится подстрока от начала строки до индекса 5
#4
print(a[:-2]) # выводится подстрока от начала строки до предпоследнего символа
#5
print(a[::2]) # печатается каждый второй символ строки, начиная с начала
#6
print(a[1::2]) # печатается каждый второй символ строки, начиная со второго символа
#7
print(a[::-1]) # выводится обратная сторона входной строки.
#8
print(a[-1:1]) # выводится пустая строка, потому что начальный индекс больше конечного
#9
print(len(a)) # выводится длина входной строки
